STMicroelectronics/stm32h7s78-dk-bsp/stm32h7s78_discovery_audio.c
   + For each mode, you may need to implement the relative callback functions into your code.
      The Callback functions are named AUDIO_IN_XXX_CallBack() and only their prototypes are declared in
      the stm32h7s78_discovery_audio.h file (refer to the example for more details on the callbacks implementations).

   + The driver API and the callback functions are at the end of the stm32h7s78_discovery_audio.h file.

  Known Limitations:
  ------------------
   1- If the TDM Format used to play in parallel 2 audio Stream (the first Stream is configured in codec SLOT0 and second
      Stream in SLOT1) the Pause/Resume, volume and mute feature will control the both streams.
   2- Parsing of audio file is not implemented (in order to determine audio file properties: Mono/Stereo, Data size,
      File size, Audio Frequency, Audio Data header size ...). The configuration is fixed for the given audio file.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h7s78_discovery_audio.h"
#include "stm32h7s78_discovery_bus.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32H7S78_DK
  * @{
  */

/** @defgroup STM32H7S78_DK_AUDIO AUDIO
  * @{
  */

/** @defgroup STM32H7S78_DK_AUDIO_Private_Macros STM32H7S78_DK AUDIO Private Macros
  * @{
  */
#define SaturaLH(N, L, H) (((N)<(L))?(L):(((N)>(H))?(H):(N)))

#define MDF_DECIMATION_RATIO(__FREQUENCY__) \
  ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (64U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (64U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (32U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (32U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (16U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (16U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (16U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_88K))  ? (8U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (8U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_176K)) ? (4U) : (4U)

#define MDF_GAIN(__FREQUENCY__) \
  ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (-4)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (-6) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (2) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (2) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (10)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (10)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (10)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_88K))  ? (18)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (18)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_176K)) ? (24) : (24)

#define MDF_CIC_MODE(__FREQUENCY__) \
  ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_88K))  ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (MDF_ONE_FILTER_SINC4) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_176K)) ? (MDF_ONE_FILTER_SINC4) : (MDF_ONE_FILTER_SINC4)

#define MDF_PROC_CLOCK_DIVIDER(__FREQUENCY__) \
  ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (2U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (1U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (2U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (1U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (2U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (1U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (2U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_88K))  ? (1U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (2U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_176K)) ? (1U) : (2U)

#define MDF_OUTPUT_CLOCK_DIVIDER(__FREQUENCY__) \
  ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (12U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (4U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (12U) \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (4U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (12U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (4U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (8U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_88K))  ? (16U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (16U)  \
  : ((__FREQUENCY__) == (AUDIO_FREQUENCY_176K)) ? (16U) : (16U)
/**
  * @}
  */

/** @defgroup STM32H7S78_DK_AUDIO_Exported_Variables STM32H7S78_DK AUDIO Exported Variables
  * @{
  */
/* Audio in and out context */
AUDIO_OUT_Ctx_t Audio_Out_Ctx[AUDIO_OUT_INSTANCES_NBR] = {{
    AUDIO_OUT_HEADPHONE,
    AUDIO_FREQUENCY_8K,
    AUDIO_RESOLUTION_16B,
    50U,
    2U,
    AUDIO_MUTE_DISABLED,
    AUDIO_OUT_STATE_RESET
  }
};

AUDIO_IN_Ctx_t  Audio_In_Ctx[AUDIO_IN_INSTANCES_NBR] = {{
    AUDIO_IN_ANALOG_MIC,
    AUDIO_FREQUENCY_8K,
    AUDIO_RESOLUTION_16B,
    2U,
    NULL,
    0U,
    50U,
    AUDIO_IN_STATE_RESET
  },
  {
    AUDIO_IN_DIGITAL_MIC,
    AUDIO_FREQUENCY_8K,
    AUDIO_RESOLUTION_16B,
    2U,
    NULL,
    0U,
    50U,
    AUDIO_IN_STATE_RESET
  }
};

/* Audio component object */
void *Audio_CompObj = NULL;

/* Audio driver */
AUDIO_Drv_t *Audio_Drv = NULL;

/* Audio in and out I2S handles */
I2S_HandleTypeDef haudio_out_i2s = {0};
I2S_HandleTypeDef haudio_in_i2s  = {0};

/* Audio in ADF handles */
MDF_HandleTypeDef haudio_in_mdf = {0};

/* Audio ADF filter configuration */
static MDF_FilterConfigTypeDef Audio_AdfFilterConfig;

/**
  * @}
  */

/** @defgroup STM32H7S78_DK_AUDIO_Private_Variables STM32H7S78_DK AUDIO Private Variables
  * @{
  */
/* Audio in and out DMA handles used by I2S */
static DMA_HandleTypeDef hDmaI2sTx, hDmaI2sRx;

/* Audio in DMA handle used by MDF */
static DMA_HandleTypeDef hDmaMdf;

#if ((USE_HAL_MDF_REGISTER_CALLBACKS == 1) || (USE_HAL_I2S_REGISTER_CALLBACKS == 1))
static uint32_t AudioOut_IsMspCbValid[AUDIO_OUT_INSTANCES_NBR] = {0};
static uint32_t AudioIn_IsMspCbValid[AUDIO_IN_INSTANCES_NBR] = {0, 0};
#endif

/* Queue variables declaration */
static DMA_QListTypeDef I2sTxQueue, I2sRxQueue, MdfRxQueue;

/* Audio in MDF internal buffer */
static int32_t Audio_DigMicRecBuff[DEFAULT_AUDIO_IN_BUFFER_SIZE];

/**
  * @}
  */

/** @defgroup STM32H7S78_DK_AUDIO_Private_Function_Prototypes STM32H7S78_DK AUDIO Private Function Prototypes
  * @{
  */
static int32_t WM8904_Probe(void);
static void    I2S_MspInit(I2S_HandleTypeDef *hi2s);
static void    I2S_MspDeInit(I2S_HandleTypeDef *hi2s);
#if (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
static void    I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s);
static void    I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s);
static void    I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s);
static void    I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s);
static void    I2S_ErrorCallback(I2S_HandleTypeDef *hi2s);
#endif /* (USE_HAL_I2S_REGISTER_CALLBACKS == 1) */

static void    MDF_MspInit(MDF_HandleTypeDef *hmdf);
static void    MDF_MspDeInit(MDF_HandleTypeDef *hmdf);
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
static void    MDF_AcqCpltCallback(MDF_HandleTypeDef *hmdf);
static void    MDF_AcqHalfCpltCallback(MDF_HandleTypeDef *hmdf);
static void    MDF_ErrorCallback(MDF_HandleTypeDef *hmdf);
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */
/**
  * @}
  */

/** @addtogroup STM32H7S78_DK_AUDIO_OUT_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the audio out peripherals.
  * @param  Instance Audio out instance.
  * @param  AudioInit Audio out init structure.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_OUT_Init(uint32_t Instance, BSP_AUDIO_Init_t *AudioInit)
{
  int32_t status = BSP_ERROR_NONE;

