STMicroelectronics/stm32h7s78-dk-bsp/stm32h7s78_discovery_audio.c
  return status;
}

/**
  * @brief  Initialize ADF1.
  * @param  hmdf  MDF handle.
  * @param  MXInit MDF configuration structure.
  * @retval HAL_status.
  */
__weak HAL_StatusTypeDef MX_ADF1_Init(MDF_HandleTypeDef *hmdf, MX_MDF_Config_t *MXInit)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* MDF peripheral initialization */
  hmdf->Init.CommonParam.ProcClockDivider = MXInit->ProcClockDivider;
  hmdf->Init.CommonParam.OutputClock.Activation = ENABLE;
  hmdf->Init.CommonParam.OutputClock.Pins = MDF_OUTPUT_CLOCK_0;
  hmdf->Init.CommonParam.OutputClock.Divider = MXInit->OutputClockDivider;
  hmdf->Init.CommonParam.OutputClock.Trigger.Activation = DISABLE;
  hmdf->Init.SerialInterface.Activation = ENABLE;
  hmdf->Init.SerialInterface.Mode = MDF_SITF_NORMAL_SPI_MODE;
  hmdf->Init.SerialInterface.ClockSource = MDF_SITF_CCK0_SOURCE;
  hmdf->Init.SerialInterface.Threshold = 31U;
  hmdf->Init.FilterBistream = MDF_BITSTREAM0_FALLING;

  if (HAL_MDF_Init(hmdf) != HAL_OK)
  {
    status = HAL_ERROR;
  }

  /* Prepare ADF filter configuration parameters */
  Audio_AdfFilterConfig.DataSource                = MDF_DATA_SOURCE_BSMX;
  Audio_AdfFilterConfig.Delay                     = 0U;
  Audio_AdfFilterConfig.CicMode                   = MXInit->CicMode;
  Audio_AdfFilterConfig.DecimationRatio           = MXInit->DecimationRatio;
  Audio_AdfFilterConfig.Gain                      = MXInit->Gain;
  Audio_AdfFilterConfig.ReshapeFilter.Activation  = ENABLE;
  Audio_AdfFilterConfig.ReshapeFilter.DecimationRatio = MDF_RSF_DECIMATION_RATIO_4;

  Audio_AdfFilterConfig.HighPassFilter.Activation = ENABLE;
  Audio_AdfFilterConfig.HighPassFilter.CutOffFrequency = MDF_HPF_CUTOFF_0_000625FPCM;

  Audio_AdfFilterConfig.SoundActivity.Activation  = DISABLE;
  Audio_AdfFilterConfig.AcquisitionMode           = MDF_MODE_ASYNC_CONT;
  Audio_AdfFilterConfig.FifoThreshold             = MDF_FIFO_THRESHOLD_NOT_EMPTY;
  Audio_AdfFilterConfig.DiscardSamples            = 0U;

  return status;
}
/**
  * @}
  */

/** @defgroup STM32H7S78_DK_AUDIO_Private_Functions STM32H7S78_DK AUDIO Private Functions
  * @{
  */
/**
  * @brief  Probe the WM8904 audio codec.
  * @retval BSP status.
  */
static int32_t WM8904_Probe(void)
{
  int32_t                  status = BSP_ERROR_NONE;
  WM8904_IO_t              IOCtx;
  uint32_t                 wm8904_id;
  static WM8904_Object_t   WM8904Obj;

  /* Configure the audio driver */
  IOCtx.Address     = AUDIO_I2C_ADDRESS;
  IOCtx.Init        = BSP_I2C1_Init;
  IOCtx.DeInit      = BSP_I2C1_DeInit;
  IOCtx.ReadReg     = BSP_I2C1_ReadReg;
  IOCtx.WriteReg    = BSP_I2C1_WriteReg;
  IOCtx.GetTick     = BSP_GetTick;

  if (WM8904_RegisterBusIO(&WM8904Obj, &IOCtx) != WM8904_OK)
  {
    status = BSP_ERROR_BUS_FAILURE;
  }
  else if (WM8904_ReadID(&WM8904Obj, &wm8904_id) != WM8904_OK)
  {
    status = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if ((wm8904_id & WM8904_ID_MASK) != WM8904_ID)
  {
    status = BSP_ERROR_UNKNOWN_COMPONENT;
  }
  else
  {
    Audio_Drv = (AUDIO_Drv_t *) &WM8904_Driver;
    Audio_CompObj = &WM8904Obj;
  }

  return status;
}

/**
  * @brief  Initialize I2S MSP.
  * @param  hi2s I2S handle.
  * @retval None.
  */
static void I2S_MspInit(I2S_HandleTypeDef *hi2s)
{
  GPIO_InitTypeDef           GPIO_InitStruct;
  static DMA_NodeTypeDef     TxNode = {0};
  static DMA_NodeTypeDef     RxNode = {0};
  static DMA_NodeConfTypeDef dmaNodeConfig = {0};

  /* Enable I2S clock */
  AUDIO_I2S6_CLK_ENABLE();

  /* I2S pins configuration: MCK, CK, WS, SDI and SDO pins */
  AUDIO_I2S6_MCK_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = AUDIO_I2S6_MCK_SDI_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_I2S6_MCK_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_I2S6_MCK_GPIO_PORT, &GPIO_InitStruct);

  AUDIO_I2S6_CK_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Alternate = AUDIO_I2S6_CK_WS_SDO_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_I2S6_CK_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_I2S6_CK_GPIO_PORT, &GPIO_InitStruct);

  AUDIO_I2S6_WS_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Pin       = AUDIO_I2S6_WS_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_I2S6_WS_GPIO_PORT, &GPIO_InitStruct);

  AUDIO_I2S6_SDI_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Alternate = AUDIO_I2S6_MCK_SDI_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_I2S6_SDI_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_I2S6_SDI_GPIO_PORT, &GPIO_InitStruct);

  AUDIO_I2S6_SDO_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Alternate = AUDIO_I2S6_CK_WS_SDO_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_I2S6_SDO_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_I2S6_SDO_GPIO_PORT, &GPIO_InitStruct);

  /* DMA for Tx */
  if (Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_RESET)
  {
    if (I2sTxQueue.Head == NULL)
    {
      AUDIO_OUT_I2S6_DMA_CLK_ENABLE();

      /* Set node type */
      dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
      /* Set common node parameters */
      dmaNodeConfig.Init.Request                        = AUDIO_OUT_I2S6_DMA_REQUEST;
      dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
      dmaNodeConfig.Init.Direction                      = DMA_MEMORY_TO_PERIPH;
      dmaNodeConfig.Init.SrcInc                         = DMA_SINC_INCREMENTED;
      dmaNodeConfig.Init.DestInc                        = DMA_DINC_FIXED;
      if (Audio_Out_Ctx[0].BitsPerSample == AUDIO_RESOLUTION_16B)
      {
        dmaNodeConfig.Init.SrcDataWidth                 = DMA_SRC_DATAWIDTH_HALFWORD;
        dmaNodeConfig.Init.DestDataWidth                = DMA_DEST_DATAWIDTH_HALFWORD;
      }
      else /* AUDIO_RESOLUTION_24b */
      {
        dmaNodeConfig.Init.SrcDataWidth                 = DMA_SRC_DATAWIDTH_WORD;
        dmaNodeConfig.Init.DestDataWidth                = DMA_DEST_DATAWIDTH_WORD;
      }
      dmaNodeConfig.Init.SrcBurstLength                 = 1;
      dmaNodeConfig.Init.DestBurstLength                = 1;
      dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
      dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
      dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
      /* Set node data handling parameters */
      dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
      dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
      /* Set node trigger parameters */
      dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;

      /* Build NodeTx */
      if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &TxNode) != HAL_OK)
      {
        BSP_AUDIO_OUT_Error_CallBack(0);
      }

      /* Insert NodeTx to I2S queue */
      else if (HAL_DMAEx_List_InsertNode_Tail(&I2sTxQueue, &TxNode) != HAL_OK)
      {
        BSP_AUDIO_OUT_Error_CallBack(0);
      }

