STMicroelectronics/stm32h7s78-dk-bsp/stm32h7s78_discovery_audio.c
      /* Set queue circular mode for I2S queue */
      else if (HAL_DMAEx_List_SetCircularMode(&I2sTxQueue) != HAL_OK)
      {
        BSP_AUDIO_OUT_Error_CallBack(0);
      }
      else
      {
        hDmaI2sTx.Instance                         = AUDIO_OUT_I2S6_DMA_CHANNEL;

        hDmaI2sTx.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
        hDmaI2sTx.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
        hDmaI2sTx.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
        hDmaI2sTx.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
        hDmaI2sTx.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_CIRCULAR;

        /* DMA linked list init */
        if (HAL_DMAEx_List_Init(&hDmaI2sTx) != HAL_OK)
        {
          BSP_AUDIO_OUT_Error_CallBack(0);
        }

        /* Link I2S queue to DMA channel */
        else if (HAL_DMAEx_List_LinkQ(&hDmaI2sTx, &I2sTxQueue) != HAL_OK)
        {
          BSP_AUDIO_OUT_Error_CallBack(0);
        }
        else
        {
          /* Associate the DMA handle */
          __HAL_LINKDMA(hi2s, hdmatx, hDmaI2sTx);

          /* I2S DMA IRQ Channel configuration */
          HAL_NVIC_SetPriority(AUDIO_OUT_I2S6_DMA_IRQ, BSP_AUDIO_OUT_IT_PRIORITY, 0);
          HAL_NVIC_EnableIRQ(AUDIO_OUT_I2S6_DMA_IRQ);
        }
      }
    }
    else
    {
      /* Set node type */
      dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
      /* Set common node parameters */
      dmaNodeConfig.Init.Request                        = AUDIO_OUT_I2S6_DMA_REQUEST;
      dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
      dmaNodeConfig.Init.Direction                      = DMA_MEMORY_TO_PERIPH;
      dmaNodeConfig.Init.SrcInc                         = DMA_SINC_INCREMENTED;
      dmaNodeConfig.Init.DestInc                        = DMA_DINC_FIXED;
      if (Audio_Out_Ctx[0].BitsPerSample == AUDIO_RESOLUTION_16B)
      {
        dmaNodeConfig.Init.SrcDataWidth                 = DMA_SRC_DATAWIDTH_HALFWORD;
        dmaNodeConfig.Init.DestDataWidth                = DMA_DEST_DATAWIDTH_HALFWORD;
      }
      else /* AUDIO_RESOLUTION_24b */
      {
        dmaNodeConfig.Init.SrcDataWidth                 = DMA_SRC_DATAWIDTH_WORD;
        dmaNodeConfig.Init.DestDataWidth                = DMA_DEST_DATAWIDTH_WORD;
      }
      dmaNodeConfig.Init.SrcBurstLength                 = 1;
      dmaNodeConfig.Init.DestBurstLength                = 1;
      dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
      dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
      dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
      /* Set node data handling parameters */
      dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
      dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
      /* Set node trigger parameters */
      dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;

      /* Build NodeTx */
      if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &TxNode) != HAL_OK)
      {
        BSP_AUDIO_OUT_Error_CallBack(0);
      }

      /* Replace NodeTx in I2S queue */
      else if (HAL_DMAEx_List_ReplaceNode_Head(&I2sTxQueue, &TxNode) != HAL_OK)
      {
        BSP_AUDIO_OUT_Error_CallBack(0);
      }

      /* Set queue circular mode for I2S queue */
      else if (HAL_DMAEx_List_ClearCircularMode(&I2sTxQueue) != HAL_OK)
      {
        BSP_AUDIO_OUT_Error_CallBack(0);
      }
      else
      {
        /* Set queue circular mode for I2S queue */
        if (HAL_DMAEx_List_SetCircularMode(&I2sTxQueue) != HAL_OK)
        {
          BSP_AUDIO_OUT_Error_CallBack(0);
        }
      }
    }
  }

  /* DMA for Rx */
  if (Audio_In_Ctx[0].State != AUDIO_IN_STATE_RESET)
  {
    if (I2sRxQueue.Head == NULL)
    {
      AUDIO_IN_I2S6_DMA_CLK_ENABLE();

      /* Set node type */
      dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
      /* Set common node parameters */
      dmaNodeConfig.Init.Request                        = AUDIO_IN_I2S6_DMA_REQUEST;
      dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
      dmaNodeConfig.Init.Direction                      = DMA_PERIPH_TO_MEMORY;
      dmaNodeConfig.Init.SrcInc                         = DMA_SINC_FIXED;
      dmaNodeConfig.Init.DestInc                        = DMA_DINC_INCREMENTED;
      dmaNodeConfig.Init.SrcDataWidth                   = DMA_SRC_DATAWIDTH_HALFWORD;
      dmaNodeConfig.Init.DestDataWidth                  = DMA_DEST_DATAWIDTH_HALFWORD;
      dmaNodeConfig.Init.SrcBurstLength                 = 1;
      dmaNodeConfig.Init.DestBurstLength                = 1;
      dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
      dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
      dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
      /* Set node data handling parameters */
      dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
      dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
      /* Set node trigger parameters */
      dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;

      /* Build NodeRx */
      if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &RxNode) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Insert NodeRx to I2S queue */
      else if (HAL_DMAEx_List_InsertNode_Tail(&I2sRxQueue, &RxNode) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Set queue circular mode for I2S queue */
      else if (HAL_DMAEx_List_SetCircularMode(&I2sRxQueue) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }
      else
      {
        hDmaI2sRx.Instance                         = AUDIO_IN_I2S6_DMA_CHANNEL;

        hDmaI2sRx.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
        hDmaI2sRx.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
        hDmaI2sRx.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT0;
        hDmaI2sRx.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
        hDmaI2sRx.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_CIRCULAR;

