STMicroelectronics/stm32h7s78-dk-bsp/stm32h7s78_discovery_audio.c
        /* DMA linked list init */
        if (HAL_DMAEx_List_Init(&hDmaI2sRx) != HAL_OK)
        {
          BSP_AUDIO_IN_Error_CallBack(0);
        }

        /* Link I2S queue to DMA channel */
        else if (HAL_DMAEx_List_LinkQ(&hDmaI2sRx, &I2sRxQueue) != HAL_OK)
        {
          BSP_AUDIO_IN_Error_CallBack(0);
        }
        else
        {
          /* Associate the DMA handle */
          __HAL_LINKDMA(hi2s, hdmarx, hDmaI2sRx);

          /* SAI DMA IRQ Channel configuration */
          HAL_NVIC_SetPriority(AUDIO_IN_I2S6_DMA_IRQ, BSP_AUDIO_IN_IT_PRIORITY, 0);
          HAL_NVIC_EnableIRQ(AUDIO_IN_I2S6_DMA_IRQ);
        }
      }
    }
    else
    {
      /* Set node type */
      dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
      /* Set common node parameters */
      dmaNodeConfig.Init.Request                        = AUDIO_IN_I2S6_DMA_REQUEST;
      dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
      dmaNodeConfig.Init.Direction                      = DMA_PERIPH_TO_MEMORY;
      dmaNodeConfig.Init.SrcInc                         = DMA_SINC_FIXED;
      dmaNodeConfig.Init.DestInc                        = DMA_DINC_INCREMENTED;
      dmaNodeConfig.Init.SrcDataWidth                   = DMA_SRC_DATAWIDTH_HALFWORD;
      dmaNodeConfig.Init.DestDataWidth                  = DMA_DEST_DATAWIDTH_HALFWORD;
      dmaNodeConfig.Init.SrcBurstLength                 = 1;
      dmaNodeConfig.Init.DestBurstLength                = 1;
      dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
      dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
      dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
      /* Set node data handling parameters */
      dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
      dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
      /* Set node trigger parameters */
      dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;

      /* Build NodeRx */
      if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &RxNode) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Replace NodeRx in I2S queue */
      else if (HAL_DMAEx_List_ReplaceNode_Head(&I2sRxQueue, &RxNode) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }

      /* Set queue circular mode for I2S queue */
      else if (HAL_DMAEx_List_ClearCircularMode(&I2sRxQueue) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(0);
      }
      else
      {
        /* Set queue circular mode for I2S queue */
        if (HAL_DMAEx_List_SetCircularMode(&I2sRxQueue) != HAL_OK)
        {
          BSP_AUDIO_IN_Error_CallBack(0);
        }
      }
    }
  }
}

/**
  * @brief  Deinitialize I2S MSP.
  * @param  hi2s I2S handle.
  * @retval None.
  */
static void I2S_MspDeInit(I2S_HandleTypeDef *hi2s)
{
  UNUSED(hi2s);

  if (Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_RESET)
  {
    /* Disable I2S DMA Channel IRQ */
    HAL_NVIC_DisableIRQ(AUDIO_OUT_I2S6_DMA_IRQ);

    /* Reset the DMA Channel configuration*/
    if (HAL_DMAEx_List_DeInit(&hDmaI2sTx) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* Reset RxQueue */
    if (HAL_DMAEx_List_ResetQ(&I2sTxQueue) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }
  }

  if (Audio_In_Ctx[0].State != AUDIO_IN_STATE_RESET)
  {
    /* Disable I2S DMA Channel IRQ */
    HAL_NVIC_DisableIRQ(AUDIO_IN_I2S6_DMA_IRQ);

    /* Reset the DMA Channel configuration*/
    if (HAL_DMAEx_List_DeInit(&hDmaI2sRx) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(0);
    }

    /* Reset RxQueue */
    if (HAL_DMAEx_List_ResetQ(&I2sRxQueue) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(0);
    }
  }

  /* De-initialize MCK, CK, WS, SDI and SDO pins */
  HAL_GPIO_DeInit(AUDIO_I2S6_MCK_GPIO_PORT, AUDIO_I2S6_MCK_GPIO_PIN);
  HAL_GPIO_DeInit(AUDIO_I2S6_CK_GPIO_PORT, AUDIO_I2S6_CK_GPIO_PIN);
  HAL_GPIO_DeInit(AUDIO_I2S6_WS_GPIO_PORT, AUDIO_I2S6_WS_GPIO_PIN);
  HAL_GPIO_DeInit(AUDIO_I2S6_SDI_GPIO_PORT, AUDIO_I2S6_SDI_GPIO_PIN);
  HAL_GPIO_DeInit(AUDIO_I2S6_SDO_GPIO_PORT, AUDIO_I2S6_SDO_GPIO_PIN);

  /* Disable I2S clock */
  AUDIO_I2S6_CLK_DISABLE();
}

#if (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
/**
  * @brief  I2S Tx transfer complete callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
static void I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{
  UNUSED(hi2s);

  BSP_AUDIO_OUT_TransferComplete_CallBack(0);
}

/**
  * @brief  I2S Tx half transfer complete callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
static void I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  UNUSED(hi2s);

  BSP_AUDIO_OUT_HalfTransfer_CallBack(0);
}

/**
  * @brief  I2S Rx transfer complete callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
static void I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{
  uint32_t index;
  uint16_t *RecBuff;

  UNUSED(hi2s);

  /* Only left channel of recorded data is relevant, copy it on right channel */
  RecBuff = (uint16_t *) (Audio_In_Ctx[0].pBuff + (Audio_In_Ctx[0].Size / 2U));
  for (index = 0; index < (Audio_In_Ctx[0].Size / 8U); index++)
  {
    RecBuff[(2U * index) + 1U] = RecBuff[2U * index];
  }
  BSP_AUDIO_IN_TransferComplete_CallBack(0);
}

/**
  * @brief  I2S Rx half transfer complete callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
static void I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  uint32_t index;
  uint16_t *RecBuff;

  UNUSED(hi2s);

  /* Only left channel of recorded data is relevant, copy it on right channel */
  RecBuff = (uint16_t *) Audio_In_Ctx[0].pBuff;
  for (index = 0; index < (Audio_In_Ctx[0].Size / 8U); index++)
  {
    RecBuff[(2U * index) + 1U] = RecBuff[2U * index];
  }
  BSP_AUDIO_IN_HalfTransfer_CallBack(0);
}

/**
  * @brief  I2S error callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
static void I2S_ErrorCallback(I2S_HandleTypeDef *hi2s)
{
  UNUSED(hi2s);

