STMicroelectronics/stm32h7s78-dk-bsp/stm32h7s78_discovery_audio.c
  BSP_AUDIO_OUT_Error_CallBack(0);
  BSP_AUDIO_IN_Error_CallBack(0);
}
#else /* (USE_HAL_I2S_REGISTER_CALLBACKS == 1) */
/**
  * @brief  I2S Tx transfer complete callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{
  UNUSED(hi2s);

  BSP_AUDIO_OUT_TransferComplete_CallBack(0);
}

/**
  * @brief  I2S Tx half transfer complete callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
void HAL_I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  UNUSED(hi2s);

  BSP_AUDIO_OUT_HalfTransfer_CallBack(0);
}

/**
  * @brief  I2S Rx transfer complete callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{
  uint32_t index;
  uint16_t *RecBuff;

  UNUSED(hi2s);

  /* Only left channel of recorded data is relevant, copy it on right channel */
  RecBuff = (uint16_t *) (Audio_In_Ctx[0].pBuff + (Audio_In_Ctx[0].Size / 2U));
  for (index = 0; index < (Audio_In_Ctx[0].Size / 8U); index++)
  {
    RecBuff[(2U * index) + 1U] = RecBuff[2U * index];
  }
  BSP_AUDIO_IN_TransferComplete_CallBack(0);
}

/**
  * @brief  I2S Rx half transfer complete callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  uint32_t index;
  uint16_t *RecBuff;

  UNUSED(hi2s);

  /* Only left channel of recorded data is relevant, copy it on right channel */
  RecBuff = (uint16_t *) Audio_In_Ctx[0].pBuff;
  for (index = 0; index < (Audio_In_Ctx[0].Size / 8U); index++)
  {
    RecBuff[(2U * index) + 1U] = RecBuff[2U * index];
  }
  BSP_AUDIO_IN_HalfTransfer_CallBack(0);
}

/**
  * @brief  I2S error callback.
  * @param  hi2s I2S handle.
  * @retval None.
  */
void HAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s)
{
  UNUSED(hi2s);

  BSP_AUDIO_OUT_Error_CallBack(0);
  BSP_AUDIO_IN_Error_CallBack(0);
}
#endif /* (USE_HAL_I2S_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Initialize MDF MSP.
  * @param  hmdf handle.
  * @retval None.
  */
static void MDF_MspInit(MDF_HandleTypeDef *hmdf)
{
  GPIO_InitTypeDef           GPIO_InitStruct;
  static DMA_NodeTypeDef     RxNode;
  static DMA_NodeConfTypeDef dmaNodeConfig;

  /* Enable ADF1 clock */
  AUDIO_ADF1_CLK_ENABLE();

  /* ADF pins configuration: DATIN0 and CCK0 pins */
  AUDIO_ADF1_DATIN0_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = AUDIO_ADF1_DATIN0_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_ADF1_DATIN0_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_ADF1_DATIN0_GPIO_PORT, &GPIO_InitStruct);

  AUDIO_ADF1_CCK0_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Alternate = AUDIO_ADF1_CCK0_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_ADF1_CCK0_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_ADF1_CCK0_GPIO_PORT, &GPIO_InitStruct);

  /* DMA configuration */
  if (MdfRxQueue.Head == NULL)
  {
    AUDIO_IN_ADF1_DMA_CLK_ENABLE();

    /* Set node type */
    dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
    /* Set common node parameters */
    dmaNodeConfig.Init.Request                        = AUDIO_IN_ADF1_DMA_REQUEST;
    dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
    dmaNodeConfig.Init.Direction                      = DMA_PERIPH_TO_MEMORY;
    dmaNodeConfig.Init.SrcInc                         = DMA_SINC_FIXED;
    dmaNodeConfig.Init.DestInc                        = DMA_DINC_INCREMENTED;
    dmaNodeConfig.Init.SrcDataWidth                   = DMA_SRC_DATAWIDTH_WORD;
    dmaNodeConfig.Init.DestDataWidth                  = DMA_DEST_DATAWIDTH_WORD;
    dmaNodeConfig.Init.SrcBurstLength                 = 1;
    dmaNodeConfig.Init.DestBurstLength                = 1;
    dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
    dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
    dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
    /* Set node data handling parameters */
    dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
    dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
    /* Set node trigger parameters */
    dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;

    /* Build NodeRx */
    if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &RxNode) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    /* Insert NodeRx to ADF queue */
    else if (HAL_DMAEx_List_InsertNode_Tail(&MdfRxQueue, &RxNode) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    /* Set queue circular mode for ADF queue */
    else if (HAL_DMAEx_List_SetCircularMode(&MdfRxQueue) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }
    else
    {
      hDmaMdf.Instance                         = AUDIO_IN_ADF1_DMA_CHANNEL;

      hDmaMdf.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
      hDmaMdf.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
      hDmaMdf.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
      hDmaMdf.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
      hDmaMdf.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_CIRCULAR;

      /* DMA linked list init */
      if (HAL_DMAEx_List_Init(&hDmaMdf) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(1);
      }

      /* Link MDF queue to DMA channel */
      else if (HAL_DMAEx_List_LinkQ(&hDmaMdf, &MdfRxQueue) != HAL_OK)
      {
        BSP_AUDIO_IN_Error_CallBack(1);
      }
      else
      {
        /* Associate the DMA handle */
        __HAL_LINKDMA(hmdf, hdma, hDmaMdf);

        /* MDF DMA IRQ Channel configuration */
        HAL_NVIC_SetPriority(AUDIO_IN_ADF1_DMA_IRQ, BSP_AUDIO_OUT_IT_PRIORITY, 0);
        HAL_NVIC_EnableIRQ(AUDIO_IN_ADF1_DMA_IRQ);
      }
    }
  }
}

/**
  * @brief  DeInitialize MDF MSP.
  * @param  hmdf MDF handle.
  * @retval None.
  */
static void MDF_MspDeInit(MDF_HandleTypeDef *hmdf)
{
  UNUSED(hmdf);

  /* Disable MDF DMA Channel IRQ */
  HAL_NVIC_DisableIRQ(AUDIO_IN_ADF1_DMA_IRQ);

