STMicroelectronics/stm32h7s78-dk-bsp/stm32h7s78_discovery_audio.c
  /* Reset the DMA Channel configuration*/
  if (HAL_DMAEx_List_DeInit(&hDmaMdf) != HAL_OK)
  {
    BSP_AUDIO_IN_Error_CallBack(1);
  }

  /* Reset RxQueue */
  if (HAL_DMAEx_List_ResetQ(&MdfRxQueue) != HAL_OK)
  {
    BSP_AUDIO_IN_Error_CallBack(1);
  }

  /* De-initialize DATIN0 and CCK0 pins */
  HAL_GPIO_DeInit(AUDIO_ADF1_DATIN0_GPIO_PORT, AUDIO_ADF1_DATIN0_GPIO_PIN);
  HAL_GPIO_DeInit(AUDIO_ADF1_CCK0_GPIO_PORT, AUDIO_ADF1_CCK0_GPIO_PIN);

  /* Disable MDF clock */
  AUDIO_ADF1_CLK_DISABLE();
}

#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
/**
  * @brief  MDF acquisition complete callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
static void MDF_AcqCpltCallback(MDF_HandleTypeDef *hmdf)
{
  uint32_t     index;
  uint32_t     recbufsize = Audio_In_Ctx[1].Size / 2U;
  __IO int32_t tmp;

  UNUSED(hmdf);

  for (index = (recbufsize / 2U); index < recbufsize; index++)
  {
    tmp = Audio_DigMicRecBuff[index] / 256;
    tmp = SaturaLH(tmp, -32768, 32767);
    Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
    Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t)((uint32_t) tmp >> 8);
  }

  /* Invoke 'TransferCompete' callback function */
  BSP_AUDIO_IN_TransferComplete_CallBack(1);
}

/**
  * @brief  MDF acquisition half complete callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
static void MDF_AcqHalfCpltCallback(MDF_HandleTypeDef *hmdf)
{
  uint32_t     index;
  uint32_t     recbufsize = Audio_In_Ctx[1].Size / 2U;
  __IO int32_t tmp;

  UNUSED(hmdf);

  for (index = 0; index < (recbufsize / 2U); index++)
  {
    tmp = Audio_DigMicRecBuff[index] / 256;
    tmp = SaturaLH(tmp, -32768, 32767);
    Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
    Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t)((uint32_t) tmp >> 8);
  }

  /* Invoke the 'HalfTransfer' callback function */
  BSP_AUDIO_IN_HalfTransfer_CallBack(1);
}

/**
  * @brief  MDF error callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
static void MDF_ErrorCallback(MDF_HandleTypeDef *hmdf)
{
  UNUSED(hmdf);

  BSP_AUDIO_IN_Error_CallBack(1);
}
#else /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */
/**
  * @brief  MDF acquisition complete callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
void HAL_MDF_AcqCpltCallback(MDF_HandleTypeDef *hmdf)
{
  uint32_t     index;
  uint32_t     recbufsize = Audio_In_Ctx[1].Size / 2U;
  __IO int32_t tmp;

  UNUSED(hmdf);

  for (index = (recbufsize / 2U); index < recbufsize; index++)
  {
    tmp = Audio_DigMicRecBuff[index] / 256;
    tmp = SaturaLH(tmp, -32768, 32767);
    Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
    Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t)((uint32_t) tmp >> 8);
  }

  /* Invoke 'TransferCompete' callback function */
  BSP_AUDIO_IN_TransferComplete_CallBack(1);
}

/**
  * @brief  MDF acquisition half complete callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
void HAL_MDF_AcqHalfCpltCallback(MDF_HandleTypeDef *hmdf)
{
  uint32_t     index;
  uint32_t     recbufsize = Audio_In_Ctx[1].Size / 2U;
  __IO int32_t tmp;

  UNUSED(hmdf);

  for (index = 0; index < (recbufsize / 2U); index++)
  {
    tmp = Audio_DigMicRecBuff[index] / 256;
    tmp = SaturaLH(tmp, -32768, 32767);
    Audio_In_Ctx[1].pBuff[2U * index]        = (uint8_t) tmp;
    Audio_In_Ctx[1].pBuff[(2U * index) + 1U] = (uint8_t)((uint32_t) tmp >> 8);
  }

  /* Invoke the 'HalfTransfer' callback function */
  BSP_AUDIO_IN_HalfTransfer_CallBack(1);
}

/**
  * @brief  MDF error callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
void HAL_MDF_ErrorCallback(MDF_HandleTypeDef *hmdf)
{
  UNUSED(hmdf);

  BSP_AUDIO_IN_Error_CallBack(1);
}
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
